Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОстаткиПениСтудентов
	Движения.ОстаткиПениСтудентов.Записывать = Истина;
	Движение = Движения.ОстаткиПениСтудентов.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Студент = Студент;
	Движение.СуммаПени = НачисленнаяПеня;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	Движения.РегистрОпераций.Записывать = Истина;
	Движение = Движения.РегистрОпераций.Добавить();
	Движение.Период = Дата;
	Движение.ТипОперации = "Начисление пени по задолженности";
	Движение.Студент = Студент;
	Движение.Сумма = НачисленнаяПеня;
КонецПроцедуры