Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОстаткиПениСтудентов
	Движения.ОстаткиПениСтудентов.Записывать = Истина;
	Движение = Движения.ОстаткиПениСтудентов.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Студент = Студент;
	Движение.СуммаПени = ПогашеннаяПеня;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	ЗаписьОперации = РегистрыСведений.РегистрОпераций.СоздатьМенеджерЗаписи();
	ЗаписьОперации.Период = Дата;
	ЗаписьОперации.ТипОперации = "Погашение пени по задолженности";
	ЗаписьОперации.Студент = Студент;
	ЗаписьОперации.Сумма = ПогашеннаяПеня;
	ЗаписьОперации.Записать();
КонецПроцедуры