Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОстаткиПениСтудентов
	Движения.ОстаткиПениСтудентов.Записывать = Истина;
	Движение = Движения.ОстаткиПениСтудентов.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Студент = Студент;
	Движение.СуммаПени = ПогашеннаяПеня;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	Движения.РегистрОпераций.Записывать = Истина;
	Движение = Движения.РегистрОпераций.Добавить();
	Движение.ТипОперации = "Погашение пени по задолженности";
	Движение.Период = Дата;
	Движение.Студент = Студент;
	Движение.Сумма = ПогашеннаяПеня;
КонецПроцедуры