&НаСервереБезКонтекста
Функция ПолучитьМножительЛьготыНаСервере(СсылкаНаЛьготу)
   Возврат СсылкаНаЛьготу.МножительЛьготы;
КонецФункции  

&НаСервереБезКонтекста
Функция ПолучитьДополнительныеНачисленияНаСервере(СсылкаДополнительныеНачисления)
   Возврат СсылкаДополнительныеНачисления.Сумма;
КонецФункции

&НаКлиенте
Процедура РассчитатьСумму(Объект) Экспорт
	МножительЛьготы = 0.0;
	ДопНач = 0.0;
	Если не Объект.Льгота.Пустая() Тогда
		МножительЛьготы = ПолучитьМножительЛьготыНаСервере(Объект.Льгота);
	КонецЕсли;
	Если не Объект.ДополнительныеНачисления.Пустая() Тогда
		ДопНач = ПолучитьДополнительныеНачисленияНаСервере(Объект.ДополнительныеНачисления);
	КонецЕсли;
	Объект.СуммаЗачисленнойОплаты = Объект.Ставка - (Объект.Ставка * МножительЛьготы)  + ДопНач;
КонецПроцедуры

&НаКлиенте
Процедура СтавкаПриИзменении()
	РассчитатьСумму(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЛьготаПриИзменении(Элемент)
	РассчитатьСумму(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНачисленияПриИзменении(Элемент)
	РассчитатьСумму(Объект);
КонецПроцедуры