Процедура НачислениеПениСтудентам() Экспорт
	//получить текущий номинал пени
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	ЗапросТекущийНоминалПени = Новый Запрос;
	ЗапросТекущийНоминалПени.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса); 
	ЗапросТекущийНоминалПени.Текст = "
		|SELECT TOP 1
		|	НоминалПени
		|FROM РегистрСведений.РегистрНоминалаПени
		|WHERE ДатаВступления <= &ТекущаяДата
		|ORDER BY ДатаВступления DESC
		|";
	ТекущийНоминалПени = ЗапросТекущийНоминалПени.Выполнить().Выгрузить();
	НоминалПени = ?(ТекущийНоминалПени.Количество() > 0, 
		ТекущийНоминалПени[0][0], 
		0);
	
	//получение суммы текущих начислений
	ТекущиеНачисленияСтудентов = РегистрыНакопления.ОстаткиНачисленийСтудентов.Остатки();
	
	//Получаем сумму начислений, срок оплаты которых ещё не прошёл
	ЗапросБудущихНачислений = Новый Запрос;
	ЗапросБудущихНачислений.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса); 
	ЗапросБудущихНачислений.Текст = "
		|SELECT
		|	Студент,
		|	SUM(СуммаЗачисленнойОплаты) AS СуммаБудущихНачислений
		|FROM Документ.НачислениеОплатыЗаОбучение
		|WHERE ДатаОплаты > &ТекущаяДата
		|GROUP BY Студент;
		|";
	БудущиеНачисленияСтудентов = ЗапросБудущихНачислений.Выполнить().Выгрузить();
	
	Для каждого ТекущиеНачисленияСтудента из ТекущиеНачисленияСтудентов Цикл
		КритерийСтудент = Новый Структура("Студент", ТекущиеНачисленияСтудента[0]);
		
		ТекущиеНачисления = ТекущиеНачисленияСтудента[1];
		БудушиеНачисленияСтудентаМассив = БудущиеНачисленияСтудентов.НайтиСтроки(КритерийСтудент);
		БудущиеНачисления = ?(БудушиеНачисленияСтудентаМассив.Количество() > 0, 
			БудущиеНачисленияСтудентов.НайтиСтроки(КритерийСтудент)[0][1], 
			0);
		Задолженность = ТекущиеНачисления - БудущиеНачисления;
		Если Задолженность > 0 Тогда
			ДокументНачисленияПени = Документы.НачислениеПениПоЗадолженности.СоздатьДокумент();
			ДокументНачисленияПени.Дата = ТекущаяДатаСеанса;
			ДокументНачисленияПени.Студент = ТекущиеНачисленияСтудента[0];
			ДокументНачисленияПени.НачисленнаяПеня = Задолженность * НоминалПени / 100;
			ДокументНачисленияПени.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры